In [26]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [27]:
ser1=pd.Series(['A','B','C'],index=[5,6,7])

In [3]:
ser1

5    A
6    B
7    C
dtype: object

In [4]:
ser2=pd.Series([5,6,7],index=['A','B','C'])

In [5]:
ser2

A    5
B    6
C    7
dtype: int64

In [29]:
ser2.index

Index(['A', 'B', 'C'], dtype='object')

In [31]:
ser2.values

array([5, 6, 7], dtype=int64)

In [7]:
ser2[2] #grab by index

7

In [8]:
ser2['A']#grab by index name

5

In [51]:
ser2[ser2>5] #grab by condition

B    6
C    7
dtype: int64

In [54]:
ser2>5 #will get boolean values

A    False
B     True
C     True
dtype: bool

In [56]:
ser2[['A','B']] #grab by multiple index name

A    5
B    6
dtype: int64

In [9]:
ser2[[1,2]]

B    6
C    7
dtype: int64

In [59]:
ser2+10 #all the values get updated by +10

A    15
B    16
C    17
dtype: int64

In [66]:
s1=pd.Series([5,6,7,8,9],index=['T','U','V','X','Y'])

In [67]:
s1

T    5
U    6
V    7
X    8
Y    9
dtype: int64

In [11]:
s2=pd.Series([5,6,np.nan,7,np.nan],index=list('TUVXY'))

In [82]:
 s2 #replace null values in s2 by s1 values

T    5.0
U    6.0
V    NaN
X    7.0
Y    NaN
dtype: float64

In [12]:
s3=s2.isnull() #to check if it has null values

In [89]:
stemp2=s2.notnull()

In [13]:
s3

T    False
U    False
V     True
X    False
Y     True
dtype: bool

In [146]:
s4=Series(np.where(s3,s1,s2),index=s2.index)

In [148]:
s4

T    5.0
U    6.0
V    7.0
X    7.0
Y    9.0
dtype: float64

In [149]:
s5=Series(np.where(s3,s1,s2),index=[0,1,2,3,4])

In [150]:
s5

0    5.0
1    6.0
2    7.0
3    7.0
4    9.0
dtype: float64

In [159]:
ser6=Series({'a':5,'b':6}) #dict to series

In [160]:
ser6

a    5
b    6
dtype: int64

In [166]:
dict1=ser6.to_dict() #series to dict

In [167]:
dict1

{'a': 5, 'b': 6}

In [372]:
dict2=pd.DataFrame({'A':[3,4],
            'B':[5,6],
            'C':[7,8]},index=list('AB'))
dict2

   A  B  C
A  3  5  7
B  4  6  8

In [373]:
df1=pd.DataFrame(np.arange(3,9).reshape(3,2),
                 index=list('ABC'),
                 columns=['col1','col2'])

In [207]:
df1

   col1  col2
A     3     4
B     5     6
C     7     8

In [213]:
df2=DataFrame({'Names':['ashok','arun'],'Age':[50,51]})
df2

   Names  Age
0  ashok   50
1   arun   51

In [214]:
df3=DataFrame({'Names':['ashok','arun'],'Age':[50,51]},index=list('AB'))
df3

   Names  Age
A  ashok   50
B   arun   51

In [18]:
df4=DataFrame({'Company':['Facebook','Amazon','Google','Yahoo','Flipkart'],'Ticker':['FB','AMZ','GOOG','YAH','FPK'],'Price':[1000,2000,50,10,300]})
df4

    Company Ticker  Price
0  Facebook     FB   1000
1    Amazon    AMZ   2000
2    Google   GOOG     50
3     Yahoo    YAH     10
4  Flipkart    FPK    300

In [222]:
df4['Company']

0    Facebook
1      Amazon
2      Google
3       Yahoo
4    Flipkart
Name: Company, dtype: object

In [229]:
df4.iloc[1]

Company    Amazon
Ticker        AMZ
Price        2000
Name: 1, dtype: object

In [233]:
df4.columns

Index(['Company', 'Ticker', 'Price'], dtype='object')

In [234]:
df4.index

RangeIndex(start=0, stop=5, step=1)

In [235]:
df4['Weight']=25

In [236]:
df4

    Company Ticker  Price  Weight
0  Facebook     FB   1000      25
1    Amazon    AMZ   2000      25
2    Google   GOOG     50      25
3     Yahoo    YAH     10      25
4  Flipkart    FPK    300      25

In [246]:
df4['Discounted_Price']=0.9*df4.Price

In [247]:
df4

    Company Ticker  Price  Discounted_Price
0  Facebook     FB   1000             900.0
1    Amazon    AMZ   2000            1800.0
2    Google   GOOG     50              45.0
3     Yahoo    YAH     10               9.0
4  Flipkart    FPK    300             270.0

In [252]:
df4['Discount']=0.1*df4.Price
df4

    Company Ticker  Price  Discounted_Price  Discount
0  Facebook     FB   1000             900.0     100.0
1    Amazon    AMZ   2000            1800.0     200.0
2    Google   GOOG     50              45.0       5.0
3     Yahoo    YAH     10               9.0       1.0
4  Flipkart    FPK    300             270.0      30.0

In [269]:
df3['OfferWeigth']=df3['Age']-df3['Age']*0.1
df3

   Names  Age  OfferWeigth
A  ashok   50         45.0
B   arun   51         45.9

In [260]:
del df4['Discount']#used to delete only 1 column

In [261]:
df4

    Company Ticker  Price  Discounted_Price
0  Facebook     FB   1000             900.0
1    Amazon    AMZ   2000            1800.0
2    Google   GOOG     50              45.0
3     Yahoo    YAH     10               9.0
4  Flipkart    FPK    300             270.0

In [262]:
del df4['Discounted_Price']

In [276]:
df4

    Company Ticker  Price
0  Facebook     FB   1000
1    Amazon    AMZ   2000
2    Google   GOOG     50
3     Yahoo    YAH     10
4  Flipkart    FPK    300

In [274]:
df3.drop(['Names','Age'],axis=1,inplace=True)# if we dont specify axis it will check for index by default ,by default it os is 1 0, for col wise it

In [275]:
df3 #drop will not make chenges in the original df, so use inplace=True,inplace will work in almost all the functions in pandas

   OfferWeigth
A         45.0
B         45.9

In [277]:
df4

    Company Ticker  Price
0  Facebook     FB   1000
1    Amazon    AMZ   2000
2    Google   GOOG     50
3     Yahoo    YAH     10
4  Flipkart    FPK    300

In [ ]:
#iloc index placed
#loc name based or for customized
#.loc for label based indexing or
#.iloc for positional indexing

In [284]:
df4.ix[1]

C:\Users\Ashok\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Company    Amazon
Ticker        AMZ
Price        2000
Name: 1, dtype: object

In [285]:
df4.iloc[1]

Company    Amazon
Ticker        AMZ
Price        2000
Name: 1, dtype: object

In [25]:
df4.loc[1]

Company    Amazon
Ticker        AMZ
Price        2000
Name: 1, dtype: object

In [287]:
df4.ix[:,1]

C:\Users\Ashok\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0      FB
1     AMZ
2    GOOG
3     YAH
4     FPK
Name: Ticker, dtype: object

In [289]:
df4.ix[3,0]

C:\Users\Ashok\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

'Yahoo'

In [290]:
#iloc is same as ix,but it will accept ly index numes r col numbers

In [24]:
df4.iloc[:4,2:]

   Price
0   1000
1   2000
2     50
3     10

In [35]:
df4.iloc[:,1]

0      FB
1     AMZ
2    GOOG
3     YAH
4     FPK
Name: Ticker, dtype: object

In [297]:
df4.iloc[3:,]

    Company Ticker  Price
3     Yahoo    YAH     10
4  Flipkart    FPK    300

In [301]:
df4.iloc[3:,1:]

  Ticker  Price
3    YAH     10
4    FPK    300

In [306]:
df4.iloc[3:,[0,2]]#to slice only cmpany and price

    Company  Price
3     Yahoo     10
4  Flipkart    300

In [307]:
df4.loc[1]

Company    Amazon
Ticker        AMZ
Price        2000
Name: 1, dtype: object

In [20]:
df4.loc[1:2,['Company','Price']]

  Company  Price
1  Amazon   2000
2  Google     50

In [310]:
df4.loc[1:3,'Company']

1    Amazon
2    Google
3     Yahoo
Name: Company, dtype: object

In [312]:
df4.loc[0:3,['Company','Ticker']]

    Company Ticker
0  Facebook     FB
1    Amazon    AMZ
2    Google   GOOG
3     Yahoo    YAH

In [313]:
#df4.loc['a',['Company','Ticker']]#if ders row name

In [315]:
df4.loc[:,['Company','Ticker']]

    Company Ticker
0  Facebook     FB
1    Amazon    AMZ
2    Google   GOOG
3     Yahoo    YAH
4  Flipkart    FPK

In [316]:
df4

    Company Ticker  Price
0  Facebook     FB   1000
1    Amazon    AMZ   2000
2    Google   GOOG     50
3     Yahoo    YAH     10
4  Flipkart    FPK    300

In [ ]:
#re-indexing

In [321]:
s1=Series([1,2,3,4],index=list('ABCD'))

In [322]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [323]:
s2=s1.reindex(list('ABCDE'))

In [324]:
s2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
dtype: float64

In [28]:
s3=Series(['India','USA','BHUTAN'],index= [1,5,10])

In [29]:
s3

1      India
5        USA
10    BHUTAN
dtype: object

In [30]:
s3.reindex(range(15),method='ffill')

0        NaN
1      India
2      India
3      India
4      India
5        USA
6        USA
7        USA
8        USA
9        USA
10    BHUTAN
11    BHUTAN
12    BHUTAN
13    BHUTAN
14    BHUTAN
dtype: object

In [338]:
s3.reindex(range(15))

0        NaN
1      India
2        NaN
3        NaN
4        NaN
5        USA
6        NaN
7        NaN
8        NaN
9        NaN
10    BHUTAN
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [339]:
s3.reindex(range(15),method='bfill')

0      India
1      India
2        USA
3        USA
4        USA
5        USA
6     BHUTAN
7     BHUTAN
8     BHUTAN
9     BHUTAN
10    BHUTAN
11       NaN
12       NaN
13       NaN
14       NaN
dtype: object

In [379]:
s3.reindex(range(15),method='nearest')

0      India
1      India
2      India
3        USA
4        USA
5        USA
6        USA
7        USA
8     BHUTAN
9     BHUTAN
10    BHUTAN
11    BHUTAN
12    BHUTAN
13    BHUTAN
14    BHUTAN
dtype: object

In [346]:
df5=pd.DataFrame(np.arange(0,16).reshape(4,4),
                 index=list('ABDE'),
                 columns=['W','X','Y','Z'])

In [347]:
df5

    W   X   Y   Z
A   0   1   2   3
B   4   5   6   7
D   8   9  10  11
E  12  13  14  15

In [348]:
df5.reindex(list('ABCDE'))

      W     X     Y     Z
A   0.0   1.0   2.0   3.0
B   4.0   5.0   6.0   7.0
C   NaN   NaN   NaN   NaN
D   8.0   9.0  10.0  11.0
E  12.0  13.0  14.0  15.0

In [351]:
df5.reindex(index=list('ABCDE'))

      W     X     Y     Z
A   0.0   1.0   2.0   3.0
B   4.0   5.0   6.0   7.0
C   NaN   NaN   NaN   NaN
D   8.0   9.0  10.0  11.0
E  12.0  13.0  14.0  15.0

In [355]:
df6=df5.reindex(index=list('ABCDE'),columns=list('WXYZA'))
df6

      W     X     Y     Z   A
A   0.0   1.0   2.0   3.0 NaN
B   4.0   5.0   6.0   7.0 NaN
C   NaN   NaN   NaN   NaN NaN
D   8.0   9.0  10.0  11.0 NaN
E  12.0  13.0  14.0  15.0 NaN

In [356]:
#drop columns and rows
df6.drop('W',axis=1)

      X     Y     Z   A
A   1.0   2.0   3.0 NaN
B   5.0   6.0   7.0 NaN
C   NaN   NaN   NaN NaN
D   9.0  10.0  11.0 NaN
E  13.0  14.0  15.0 NaN

In [357]:
df6.drop('A',axis=1)

      W     X     Y     Z
A   0.0   1.0   2.0   3.0
B   4.0   5.0   6.0   7.0
C   NaN   NaN   NaN   NaN
D   8.0   9.0  10.0  11.0
E  12.0  13.0  14.0  15.0

In [366]:
#sorting
s1=Series(range(1,4),index=list('CAB'))

In [367]:
s1

C    1
A    2
B    3
dtype: int64

In [368]:
s2=s1.sort_index() #sorting on basis of index

In [369]:
s2

A    2
B    3
C    1
dtype: int64

In [370]:
s2.sort_values()#sorting on basis of values

C    1
A    2
B    3
dtype: int64

In [374]:
s3

1      India
5        USA
10    BHUTAN
dtype: object

In [376]:
s3.reindex(range(15),fill_value=0)

0          0
1      India
2          0
3          0
4          0
5        USA
6          0
7          0
8          0
9          0
10    BHUTAN
11         0
12         0
13         0
14         0
dtype: object